*** Ionization potentials
- Return to this [2024-01-30 Tue]
  - I want to expand the table and figure to include ions that are seen in the Spitzer spectra
  - These are
    - Ne II, III
    - Si I (this is the only element that I did not have)
    - S III, IV
- Where did I get these from? [2022-10-22 Sat]
  - Looks like https://en.wikipedia.org/wiki/Ionization_energies_of_the_elements_(data_page)
- [2024-02-01 Thu] Turns out that I had a mistake in my figure with the Spitzer images. It is not [Si IV], but [S IV] 10.51 micron that we see.
- This is good because we now have two adjacent stages of the same element
     
|      |       eV |   Ryd |
|------+----------+-------|
| K^0   |  4.34066 | 0.319 |
| Si^0  |  8.15169 | 0.599 |
| S^0   |  10.3600 | 0.762 |
| Cl^0  |  12.9676 | 0.954 |
|------+----------+-------|
| H^0   |  13.5984 | 1.000 |
| O^0   |  13.6181 | 1.001 |
| N^0   |  14.5341 | 1.069 |
| Ar^0  |  15.7596 | 1.159 |
| Si^{+}  | 16.34585 | 1.202 |
| Ne^0  |  21.5646 | 1.586 |
| S^{+}   |   23.338 | 1.716 |
| Cl^{+}  |   23.814 | 1.751 |
| C^{+}   |   24.385 | 1.793 |
|------+----------+-------|
| He^0  |  24.5874 | 1.808 |
| Ar^{+}  |   27.630 | 2.032 |
| N^{+}   |   29.601 | 2.177 |
| K^{+}   |    31.63 | 2.326 |
| Si^{+2} | 33.49302 | 2.463 |
| S^{+2}  |    34.86 | 2.564 |
| O^{+}   |   35.121 | 2.583 |
| Cl^{+2} |    39.80 | 2.927 |
| Ne^{+}  | 40.96328 | 3.012 |
| Ar^{+2} |   40.735 | 2.996 |
| Si^{+3} | 45.14181 | 3.320 |
| K^{+2}  |   45.806 | 3.368 |
| S^{+3}  |   47.222 | 3.473 |
| Cl^{+3} |    53.24 | 3.915 |
|------+----------+-------|
| He^{+}  |   54.418 | 4.002 |
| O^{+2}  |   54.936 | 4.040 |
| Ar^{+3} |    59.58 | 4.381 |
| K^{+3}  |    60.91 | 4.479 |
| Ne^{+2} |    63.45 | 4.666 |
| K^{+4}  |    82.66 | 6.079 |
#+TBLFM: $3=$2 / 13.5984;f3
+ So this might explain why [O III] does not overlap with He II, but [Ar IV] does
|   IP | Edge     | H        | He         | S       | Ar       | O       | Cl       | Si       | K      | Ne       |
|------+----------+----------+------------+---------+----------+---------+----------+----------+--------+----------|
|  8.2 | Si 0     |          |            |         |          | [O I]   |          | *[Si II] |        |          |
| 10.4 | S 0      |          |            | [S II]  |          | [O I]   |          | *[Si II] |        |          |
| 13.0 | Cl 0     |          |            | [S II]  |          | [O I]   | [Cl II]  | *[Si II] |        |          |
|------+----------+----------+------------+---------+----------+---------+----------+----------+--------+----------|
| 13.6 | H 0, O 0 | H I 4861 |            | [S II]  |          | [O II]  | [Cl II]  | *[Si II] |        |          |
| 15.8 | Ar 0     | H I 4861 |            | [S II]  | [Ar II]  | [O II]  | [Cl II]  | *[Si II] |        |          |
| 16.3 | Si +     | H I 4861 |            | [S II]  | [Ar II]  | [O II]  | [Cl II]  |          |        |          |
| 21.6 | Ne 0     | H I 4861 |            | [S II]  | [Ar II]  | [O II]  | [Cl II]  |          |        | *[Ne II] |
| 23.3 | S +      | H I 4861 |            | [S III] | [Ar II]  | [O II]  | [Cl II]  |          |        | *[Ne II] |
| 23.8 | Cl +     | H I 4861 |            | [S III] | [Ar II]  | [O II]  | [Cl III] |          |        | *[Ne II] |
|------+----------+----------+------------+---------+----------+---------+----------+----------+--------+----------|
| 24.6 | He 0     | H I 4861 | He I 5875  | [S III] | [Ar II]  | [O II]  | [Cl III] |          |        | *[Ne II] |
| 27.6 | Ar +     | H I 4861 | He I 5875  | [S III] | [Ar III] | [O II]  | [Cl III] |          |        | *[Ne II] |
| 33.5 | Si +2    | H I 4861 | He I 5875  | [S III] | [Ar III] | [O II]  | [Cl III] |          |        |          |
| 34.9 | S +2     | H I 4861 | He I 5875  | *[S IV] | [Ar III] | [O II]  | [Cl III] |          |        | *[Ne II] |
| 35.1 | O +      | H I 4861 | He I 5875  | *[S IV] | [Ar III] | [O III] | [Cl III] |          |        | *[Ne II] |
| 39.8 | Cl +2    | H I 4861 | He I 5875  | *[S IV] | [Ar III] | [O III] | [Cl IV]  |          |        | *[Ne II] |
| 40.7 | Ar +2    | H I 4861 | He I 5875  | *[S IV] | [Ar IV]  | [O III] | [Cl IV]  |          |        | *[Ne II] |
| 41.0 | Ne +     | H I 4861 | He I 5875  | *[S IV] | [Ar IV]  | [O III] | [Cl IV]  |          |        | [Ne III] |
| 45.1 | Si +3    | H I 4861 | He I 5875  | *[S IV] | [Ar IV]  | [O III] | [Cl IV]  |          |        |          |
| 45.8 | K +2     | H I 4861 | He I 5875  | *[S IV] | [Ar IV]  | [O III] | [Cl IV]  |          | [K IV] | [Ne III] |
| 47.2 | S +3     | H I 4861 | He I 5875  |         | [Ar IV]  | [O III] | [Cl IV]  |          | [K IV] | [Ne III] |
| 53.2 | Cl +3    | H I 4861 | He I 5875  |         | [Ar IV]  | [O III] |          |          | [K IV] | [Ne III] |
|------+----------+----------+------------+---------+----------+---------+----------+----------+--------+----------|
| 54.4 | He +     | H I 4861 | He II 4686 |         | [Ar IV]  | [O III] |          |          | [K IV] | [Ne III] |
| 54.9 | O +2     | H I 4861 | He II 4686 |         | [Ar IV]  |         |          |          | [K IV] | [Ne III] |
| 59.6 | Ar +3    | H I 4861 | He II 4686 |         |          |         |          |          | [K IV] | [Ne III] |
| 60.9 | K +3     | H I 4861 | He II 4686 |         |          |         |          |          |        | [Ne III] |
| 63.5 | Ne +2    | H I 4861 | He II 4686 |         |          |         |          |          |        |          |
** Look at fractional excess in different features
- Compare the following
  - medium ionization peak
  - globules
  - bow shock
- In a bunch of different lines
  - measure in DS9

| Line      | sii 6731        | hei 5875        | hi 4861         | siii 9069       | ariii 7136      | oiii 5007       |
|-----------+-----------------+-----------------+-----------------+-----------------+-----------------+-----------------|
| BG left   | 380 +/- 30      | 1200 +/- 100    | 12000 +/- 1000  | 1490 +/- 90     | 980 +/- 60      | 83800 +/- 3900  |
| Med Peak  | 620             | 1630            | 15600           | 2200            | 1300            | 98200           |
| BG mid    | 770 +/- 30      | 1590 +/- 50     | 15500 +/- 380   | 1590 +/- 90     | 1170 +/- 40     | 99700 +/- 1500  |
| Bow shock | 990             | 2210            | 21120           | 1910            | 1530            | 135600          |
| BG Glob   | 1420 +/- 115    | 2160 +/- 60     | 20600 +/- 330   | 1750 +/- 90     | 1500 +/- 50     | 129000 +/- 3000 |
| Globule   | 1940            | 2480            | 23000           | 2360            | 1760            | 136600          |
| BG right  | 590 +/- 100     | 1800 +/- 100    | 17200 +/- 930   | 1910 +/- 100    | 1410 +/- 50     | 115500 +/- 2800 |
|-----------+-----------------+-----------------+-----------------+-----------------+-----------------+-----------------|
| Med Peak  | 0.078 +/- 0.037 | 0.168 +/- 0.041 | 0.135 +/- 0.039 | 0.429 +/- 0.045 | 0.209 +/- 0.034 | 0.070 +/- 0.023 |
| Bow Shock | 0.286 +/- 0.041 | 0.390 +/- 0.034 | 0.363 +/- 0.026 | 0.201 +/- 0.058 | 0.308 +/- 0.036 | 0.360 +/- 0.016 |
| Globule   | 0.930 +/- 0.104 | 0.253 +/- 0.030 | 0.217 +/- 0.027 | 0.290 +/- 0.038 | 0.210 +/- 0.025 | 0.117 +/- 0.017 |
#+TBLFM: @9$7..@9$2=2 (@3 - (@2 + @4)/2)/(@2 + @4);f3::@10$7..@10$2=(@5 - @4)/@4;f3::@11$7..@11$2=2 (@7 - (@6 + @8)/2)/(@6 + @8);f3

- Final table of the contrasts for each line and each feature
  - I have omitted sii from bow shock, since that is clearly the flank of the second globule peak
  - I have also omitted Hi and Hei since they do not really add anything


#+name: emline-excess-table
| Line             |    MP |   eMP |    BS |   eBS |    BG |  eBG" |
| [S II]\n6731"    | 0.078 | 0.037 |     0 |     0 | 0.930 | 0.104 |
| "[S III]\n9069"  | 0.429 | 0.045 | 0.201 | 0.058 | 0.290 | 0.038 |
| "[Ar III]\n7136" | 0.209 | 0.034 | 0.308 | 0.036 | 0.210 | 0.025 |
| "H I\n4861"      | 0.135 | 0.039 | 0.363 | 0.026 | 0.217 | 0.027 |
| "[O III]\n5007"  | 0.070 | 0.023 | 0.360 | 0.016 | 0.117 | 0.017 |

#+header: :var TAB=emline-excess-table
#+begin_src python :tangle ../scripts/emline-excess.py :eval no
  from astropy.table import Table
  from matplotlib import pyplot as plt
  import seaborn as sns
  sns.set_context("talk")
  tab = Table(rows=TAB[1:], names=TAB[0])
  figfile = "emline-excess-plot.pdf"
  fig, ax = plt.subplots()
  line, = ax.plot(tab["Line"], tab["MP"])
  ax.errorbar(tab["Line"], tab["MP"], yerr=tab["eMP"], fmt="o", color=line.get_color())
  line, = ax.plot(tab["Line"], tab["BS"])
  ax.errorbar(tab["Line"], tab["BS"], yerr=tab["eBS"], fmt="D", color=line.get_color())
  line, = ax.plot(tab["Line"], tab["BG"])
  ax.errorbar(tab["Line"], tab["BG"], yerr=tab["eBG"], fmt="s", color=line.get_color())
  ax.set(ylabel="Brightness / Background")
  sns.despine()
  fig.tight_layout()
  fig.savefig(figfile)
  print(figfile, end="")
#+end_src

#+begin_src sh :results file
  python ../scripts/emline-excess.py # 1>&2
#+end_src

#+RESULTS:
[[file:emline-excess-plot.pdf]]


- [X] Next job is to plot this
** Cl IV diagnostics

#+begin_src python :results output verbatim
  import pyneb as pn
  cl4 = pn.Atom("Cl", 4)
  Ts = [10000, 15000, 20000]
  dens = [1.0, 10.0, 100.0]
  e8046 = cl4.getEmissivity(tem=Ts, den=dens, wave=8046)
  e7531 = cl4.getEmissivity(tem=Ts, den=dens, wave=7531)
  e5323 = cl4.getEmissivity(tem=Ts, den=dens, wave=5323)
  print("8046", e8046)
  print("7531/8046", e7531 / e8046)
  print("5323/7531", e5323 / e7531)
#+end_src

#+RESULTS:
: 8046 [[1.67869951e-20 1.67889008e-20 1.68077082e-20]
:  [2.67346244e-20 2.67362017e-20 2.67518043e-20]
:  [3.31965858e-20 3.31978359e-20 3.32102162e-20]]
: 7531/8046 [[0.28610481 0.28610481 0.28610481]
:  [0.28610481 0.28610481 0.28610481]
:  [0.28610481 0.28610481 0.28610481]]
: 5323/7531 [[0.08643893 0.08643919 0.08644182]
:  [0.22672898 0.22673009 0.22674121]
:  [0.35442452 0.35442619 0.35444295]]

